app/controllers/api/v1/cards_controller.rb

SELECT "cards".* FROM "cards"
---
  def index
    cards = Card.all

SELECT "cards".* FROM "cards" WHERE "cards"."id" = ? LIMIT ?  [["id", 22], ["LIMIT", 1]]
---
  def show
    card = Card.find_by(id: params[:id])