app/controllers/api/v1/games_controller.rb

SELECT "games".* FROM "games" WHERE "games"."id" = ? LIMIT ?  [["id", 510], ["LIMIT", 1]]
UPDATE "games" SET "score" = ?, "status" = ?, "updated_at" = ? WHERE "games"."id" = ?  [["score", 54], ["status", "completed"], ["updated_at", "2019-10-03 14:26:48.970921"], ["id", 510]]
---
    def update
        game = Game.find(params[:id])
        if game.update(game_params)

INSERT INTO "games" ("score", "status", "created_at", "updated_at", "user_id") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["score", 0], ["status", "in progress"], ["created_at", "2019-11-20 18:56:32.204969"], ["updated_at", "2019-11-20 18:56:32.204969"], ["user_id", 1]]
---
    def create
        game = Game.new(game_params)
        if game.save