app/controllers/api/v1/users_controller.rb

INSERT INTO "users" ("name", "created_at", "updated_at") VALUES ($1, $2, $3) RETURNING "id"  [["name", "amy"], ["created_at", "2019-11-20 18:56:30.473318"], ["updated_at", "2019-11-20 18:56:30.473318"]]
---
    def create
        user = User.new(user_params)
        if user.save