app/models/game.rb

SELECT "games".* FROM "games"
---
    def self.completed_games
        self.all.filter do |game|